[
  {
    "id": "2",
    "title": "Resume",
    "slug": "resume",
    "body":  "<h4>CONTACT</h4>\n<p>959 Eden Ave SE, Atlanta GA 30316<br>\n(studio) 917.656.1801<br>\n<a href=\"mailto:jeremy@jeremydost.com\">jeremy@jeremydost.com</a><br>\n<a href=\"http://www.jeremydost.com/\">www.jeremydost.com</a></p>\n\n<h4>PERSONAL</h4>\n\n<p>Born in Cleveland, Ohio on January 30,1973</p>\n\n<h4>EXHIBITIONS</h4>\n\n<p><strong>2003</strong><br>\n\"The MONSTER Project, NY\" WAX, Brooklyn, NY<br>\n\"Recession 2003 — $99 Show\" Cynthia Broan Gallery, New York, NY</p>\n\n<p><strong>2002</strong><br>\n\n\"The MONSTER Project\" Ballroom Studios, Atlanta, GA<br>\n\"New Drawings\" SuperCore, Brooklyn, NY</p>\n\n<p><strong>2001</strong><br>\n\"Studio Paintings\", Figure Works, Brooklyn, NY<br>\n\"Poetry Works\" Ballroom Studios, Atlanta, GA<br>\n\"New Paintings\" 55 Berry, Brooklyn, NY<br>\n\"1st Annual Art Auction\" Ballroom Studios, Atlanta, GA</p>\n\n<p><strong>2000</strong><br>\n\n<span class=\"bigOrange\">*</span> \"The Artist Myth: New Work by Jeremy Dost\", Ballroom Studios Atlanta, GA<br>\n\"The Shed Show\" Atlanta, GA<br>\nGroup Show FigureWorks, Brooklyn, NY</p>\n\n<p><strong>1999</strong><br>\n\"Introductions\" 55 Berry, Brooklyn, NY<br>\n\"Studio Works 1\" Ballroom Studios, Atlanta, GA<br>\n\"Ten Hands\" Ballroom Studios, Atlanta, GA</p>\n\n<p><strong>1998</strong><br>\n\"The Blue Dress Project\" Ballroom Studios, Atlanta, GA<br>\n\"Benefit for Vicky Martinez\" Mira Mar Gallery, Sarasota, FL<br>\n\"ANY Figure Show\" Allied Factory Lofts, Atlanta, GA</p>\n\n<p><strong>1997</strong><br>\n\"Look Up, Get Down\" Allied Factory Lofts, Atlanta, GA<br>\nArtCare Annual Benefit Auction Swiss Hotel, Atlanta, GA</p>\n\n<p><strong>1996</strong><br>\n\"BODY\"  Space 2793, Atlanta, GA<br>\n\"Artparty Exhibit\", 500 Means Street, Atlanta, GA</p>\n\n<p><strong>1995</strong><br>\n\"Juried Student Exhibition\"  Atlanta College of Art Gallery, Atlanta, GA<br>\n\"Landscape Visions\", Gallery 100, Atlanta, GA</p>\n\n<p><strong>1994</strong><br>\n<span class=\"bigOrange\">*</span> \"Recent Works, Jeremy Dost\", Revolution, Atlanta, GA<br>\n\nOne Week Show, Sylvia's Art of this Century, Atlanta, GA<br>\nAtlanta Arts Festival: Booth by Sylvia's AOTC, Atlanta, GA</p>\n\n<p><strong>1993</strong><br>\n\"X—POZ—URE\", 500 Means Street, Atlanta, GA</p>\n\n\n<p><span class=\"bigOrange\">*</span> — solo exhibitions</p>\n\n<h4>SELECTED PRIVATE COLLECTIONS</h4>\n<ul>\n<li>John Ambrose, Georgia</li>\n<li>Ward Edwards, Georgia</li>\n<li>William Gould, Gerogia</li>\n<li>Lee Hartnet, Texas</li>\n<li>Judy Jenkins, Georgia</li>\n\n<li>John and Nicole Mills, Georgia</li>\n<li>Betty Pinkerton, Tennessee</li>\n<li>Jerry W. Poole ASID, Georgia</li>\n<li>Art and Denise Requenez, NYC</li>\n<li>Dr. Lynn Williams, Tennessee</li>\n</ul>\n\n<h4>EDUCATION</h4>\n<p>1995—The Atlanta College of Art, Atlanta, Georgia; BFA, Painting</p>"
  },
  {
    "id": "1",
    "title": "Bio",
    "slug": "bio",
    "body": "<p>Jeremy Dost was born in Cleveland, Ohio on January 30, 1973. Shortly after, his family moved to the gulf coast of Florida, and this is where he was raised. There is an affinity for vast spaces and a warm light in all of his work that comes from the Florida landscape. His passion for art began in high school and classes at the local art center, where Florida painter Christopher Still mentored him. After high school, this passion led him to the Atlanta College of Art. He majored in painting there, and graduated in 1995 with a Bachelor of Fine Art degree. At ACA, Jeremy had the opportunity to work with artists such as Rocio Rodriquez, Alan Loehle, Fred Gregory, Deanna Sirlin, David Pettrow, and Jena Jones. It was also during this time that he first began exhibiting his work.</p>\n<p>These first exhibits included juried school shows and group exhibits organized by North Side Crew Urban Arts Society (NSC), an alternative art space of which he was a founding member. His first solo exhibition came while still in school, in 1994. He continued to show primarily in artist—organized exhibitions including \"Body\" in 1996 and the well received \"ANY figure\" show in 1998. His involvement in Atlanta's underground arts community culminated in 1998 when, along with 3 other artists, he began Ballroom Studios, a not—for—profit (501c3) space dedicated to supporting underrepresented art. Two notable exhibits he participated in there are the \"Blue Dress Project\" and \"Ten Hands\", both voted 'Best of' the year by Atlanta Press.</p>\n<p>In the spring of 1999, Jeremy moved to the Williamsburg area of Brooklyn, New York where he currently lives and works. He still maintains his role with Ballroom Studios in Atlanta, curating shows, helping to organize their artist—exchange program, as well as serving on their board of directors. As well, he and 2 other artists have opened a New York office for the Ballroom, and will be presenting their first big production this fall. Most importantly though, Jeremy has continued his drive to create and exhibit his work, participating in shows both in Atlanta and New York.</p>"
  }
]
